rhoEnergyFoam_v6/tutorials/hit/0/p
 /*--------------------------------*-C++ -*----------------------------------*
 | ========= |
 |       /  F ield         | OpenFOAM: The Open Source CFD Toolbox           | 
 |  /  O peration | Version:  2.1.1 
 |        A nd    | Web www.OpenFOAM.org |
 |   /     M anipulation  |         
 *----------------------------------------*/
 FoamFile
 {
     version     2.0;
     format      ascii;
     class       volScalarField;
     location  "0"; 
     object      p; 
 }
 // * * * * * * * * * * * * * * * * * * * * * * * //
 dimensions      [1 -1 -2 0 0 0 0];
 internalField   nonuniform List<scalar> 
 
       32768
 
 (
   1.000000    
   1.000000    
   1.000000    
   1.000000    
   1.000000    
   1.000000    
   1.000000    
   1.000000    
   1.000000    
   1.000000    
   1.000000    
   1.000000    
   1.000000    
   1.000000    
   1.000000    
   1.000000    
   1.000000    
   1.000000    
   1.000000    
   1.000000    
   1.000000    
   1.000000    
   1.000000    
   1.000000    
   1.000000    
   1.000000    
   1.000000    
   1.000000    
   1.000000    
   1.000000    
   1.000000    
   1.000000    
   1.000000    
   1.000000    
   1.000000    
   1.000000    
   1.000000    
   1.000000    
   1.000000    
   1.000000    
   1.000000    
   1.000000    
   1.000000    
   1.000000    
   1.000000    
   1.000000    
   1.000000    
   1.000000    
   1.000000    
   1.000000    
   1.000000    
   1.000000    
   1.000000    
   1.000000    
   1.000000    
   1.000000    
   1.000000    
   1.000000    
   1.000000    
   1.000000    
   1.000000    
   1.000000    
   1.000000    
   1.000000    
   1.000000    
   1.000000    
   1.000000    
   1.000000    
   1.000000    
   1.000000    
   1.000000    
   1.000000    
   1.000000    
   1.000000    
   1.000000    
   1.000000    
   1.000000    
   1.000000    
   1.000000    
   1.000000    
   1.000000    
   1.000000    
   1.000000    
   1.000000    
   1.000000    
   1.000000    
   1.000000    
   1.000000    
   1.000000    
   1.000000    
   1.000000    
   1.000000    
   1.000000    
   1.000000    
   1.000000    
   1.000000    
   1.000000    
   1.000000    
   1.000000    
...
 );
 boundaryField
 {
     patch0_half0
     {
   type            cyclic;
     }
     patch1_half0
     {
         type            cyclic;
     }
     patch2_half0
     {
         type            cyclic;
     }
     patch2_half1
     {
         type            cyclic;
     }
     patch1_half1
     {
         type            cyclic;
     }
     patch0_half1
     {
         type            cyclic;
     }
 }
